{"pages":[],"posts":[{"title":"靠PE选股有用吗??","text":"PE, ROE, DY到底哪一个才有用?? 价值投资者们推崇低PE, 用最高的安全边际来买股. 成长型投资者又不这么认为了, 他们就认为成长中的公司就算有高PE也是没关系的, 股票里没有对与错就只有最适合自己的策略. 言归正题, 到底哪一个指标才能帮助你找到能赚钱的好股呢? 我们来探讨一下. 隆重介绍 klsequant 股票回测网络程序今天我就像大家介绍我在MCO期间写的一个网络程序 https://www.klsequant.com 这个程序有什么功能呢? 它能拿来做什么? 能吃的吗? 它的功能是, 当你想出或找到一个选股策略时, 例如当PE小于10和ROE大于20的时候买入. 然后你就能用klsequant来回测你的选股策略, 来评估这个策略过去的表现. 这个程序会显示过去10年的表现, 它用的数据是2010-2019每一个在马来西亚上市的股票. 这个网络程序是基于Python Flask框架来develope的. 虽然以前经常用Python来做分析可是没有试过在web的环境用Python, 这也算是对我自己的一个技术挑战. Code好后我用的是 pythonanywhere 来host这个程序. 如果你也有用Python的话可以看看这个服务, 价钱合理, 也有免费的配套. 用户界面 UI 先来简单介绍一下界面, 这里有总共14个选项给你, Maximum number of Shares(最高持股数量) 这栏是必填的, 其他选项就根据你选股策略来填, 不需要的就空着罢了. Demo话不多说, 先来个demo. 我想回测我的选股策略, 我的策略如下 PE 小于 10 ROE 大于 15 DY 大于 3 如果某个股票符合这个条件的话, 程序就会”买入”. 一个月后, 重复这个过程, 如果上个月”买入”的股项还符合你的策略, 那么程序就会继续保留这个股票, 如果已经不符合了, 程序就会把那个股票”卖出”. 如果你想玩更长期的, 可以在下面的选项选weekly, monthly, 最久的是yearly. 这就是你调配仓位的频率, 就要看你的策略是长期还是短期策略咯. 你也可以实验一下到底长期还是短期投资比较好. 到底我的选股策略表现如何呢? 回测结果是这个策略的年华回酬是36%, 算是非常好的回酬了. 而且这个策略也跑赢了大市(红线是大马综合指数的回酬). Capital RM1,000的意思是起初资金是1千. 再仔细一点的解释如下 绿线代表的是你策略的资金成长线, 红线代表大马综合指数的资金成长. 要怎么评估你的策略好不好呢, 一个常用的策略是用大市来比较. (如果你的策略跑输大市你不如直接买马股ETF更好) Maximum return是期间这个策略最大的一个收益, 这里显示是48.3%, 意思是说这期间有一个股票在一个月里达到了48.4%的回酬. Minimum return, 最低回酬是-13.81%, 这也不错嘛最大回酬远远比最低回酬高. Average return是指你平均每一个交易的回酬是多少. CAGR就是年化回酬, 这策略有着36%的年化回酬. 话说这策略也大大的跑赢了指数, 10年间这个策略会把你的RM1,000变成RM16,000, 反而指数只能把你的RM1,000变成RM1,131. 所以这个策略到底抓到了什么股呢? 这个表格就显示了期间所有被这个策略抓到的股票. 从这里你可以大概知道你策略选出来的公司是怎么样的. 你也许会好奇为什么一下月份只持有3个股票, 这是因为当时符合条件的股票只有3个, 所以可以”买入”的就只有3个. (有没有发现到这个策略抓到了一个超级牛股 VITROX?) 事后想法在收笔前我们来做一个实验. 根据PE选股可靠吗?? 策略如下 Number of Stocks to buy : 10 Minimum ROE: 10我们就来看看, 在盈利能力(ROE)一样的情况下, 高PE和低PE的股票的表现. 高PE策略 低PE策略 回测结果也不用多说了, 低PE策略是明显的跑赢高PE策略. 可是这是一个很大概的概念而已, 不是所有高PE的股都不会涨. (就像TOPGLOVE从PE60涨到PE100++). 投资界大佬Howard Marks也说 “An overpriced stock doesn’t mean that it will drop tomorrow”, 意思是一个高估的股票不代表它明天就会掉. 股市里没有绝对, 可是从数据里我们也可以找到可以大概率跑赢的策略的. 不足之处这个网络程序也不是100%完美的, 也有一下不足的地方 没有技术分析的选项, 可能你的策略是要等MA, MACD黄金交叉的, 可是目前这个程序只能分析基本面. (如果反应好的话可能会加入技术分析选项, 需要时间和精力来开发哈哈) 没有考虑到交易费用. 如果你的本钱小的话, 交易费用会占你本金很大的比例. 好吧今天就到这里了, 如果有什么feedback可以在下面留言(不管是好是坏, 有feedback才能做得更好). 以上文章只供学习用途不是投资建议","link":"/zh-cn/Introduction-to-klsequant/"},{"title":"蜡烛图技术分析在马股有用吗? 胜率有多高?","text":"在股市/汇市有几年经验的朋友相信都知道什么是蜡烛图可是有没有想过蜡烛图在马股的胜率有多大呢? 到底蜡烛图是不是个可靠的指标? 介绍这里就不多加介绍蜡烛图的构造和历史了, 有兴趣的朋友可以上网搜索有关资讯, 而且有关资讯也相当丰富, 也不用我来介绍了. 研究方法小编用了Python编程程序来回测各个蜡烛图形在过去10年马股每一个个股的表现. 不过小编觉得大家应该想直接看结果, 所以编码就不放这里解释了. 如果对编码有兴趣可以留言. 结果程序计算了每个蜡烛图形在马股每一个个股在 (1,5,10,30) 天过后的表现. 0.7的表现就等于在10次出现该蜡烛图形后, 有7次股价是上涨的. 小编整理了一些数据并列出5个最好的最坏的蜡烛图案 嫌不够吗? 整个表格够不 神奇的是, 许多牛市信号都有着非常低的赢率, 个人推断是因为当大家都使用同一个信号的时候, 其获利能力将会大大减少. 其实以上的结果是出乎我的意料的, 因为没想到竟然很少指标有超过50%的胜率. 可是值得一提的是有些蜡烛图形有超过0.45的胜率. 如果配合其他的指标和风险管理的话这可能是可以持续性获利的交易指标. 想法这个回测程序也不是100%完美的, 一些弱点比如没有考虑蜡烛形态出现的地方 (有些形态是在低位/高位才比较有效的). 无论如何这次的研究也初步展示了蜡烛图形在马股的有效性和胜率. 或许蜡烛图形必须配合其他技术指标才能达到比较高的胜率. 值得一提的是, 0.2胜率的图形也可以当成反向指标来使用 (0.2的胜率代表图形出现后下跌的概率偏大) 这项研究的出发点是学习和探索用途. 交易自负","link":"/zh-cn/first-md/"},{"title":"你有听过72法则吗? 为什么是72? 不是71, 73?","text":"到底72法则是怎么来的? 数学家们为什么会用72这个数字呢 神奇的72法则相信大家多少都听过72法则吧. 72法则是一个方程式来让你计算你的投资要多久才会翻倍的方程式. 先来个例子, 如果一项投资能带来20%的回酬, 你需要多久才能翻倍? time = 72/x time = 72/20 time = 3.6 years如何证实? 1 x 1.2 x 1.2 x 1.2 x 1.2 = 2.07虽然不是100%准确, 可是用来估计是非常不错了 不知道你们有没有想过72这个数字是怎么来的呢?我们都知道, FV = PV x (1+x)^t FV = Future Value PV = Present Value r = return t = time如果我们要翻倍的话, 2PV = PV, 2PV = PV (1+r)^t 2 = (1+r)^t两边都加上natural logarithm ln(2) = t ln(1+r) t = ln(2) / ln(1+r)然后我们引用 taylor series expansion, $ln(1+r) = x - \\frac{x^2}{2} + \\frac{x^3}{3} - \\frac{x^4}{4} …..$(别叫我解释)如果r是足够小的话, 我们可以假设 ln(1+r) = r t = ln(2)/r t = 0.693/r为了容易计算, 我们把它 x100 t = 69.3/r可是答案不是72啊, 为什么呢? 看到这里是不是觉得被坑了如果我们用的是69, 69 只能被1,3,23,69除, 那么计算起来没那么方便如果我们用的是72, 72可以被1,2,3,4,6,8,12,18,24,36,72除, 可以很快的就算出答案 总结一下, 72法则是让我们可以快速计算一项投资的方程式. 虽然不是100%准确可是算出来的答案跟实际答案不会有太大偏差. 以下是72法则与实际答案的偏差","link":"/zh-cn/Rule-of-72/"},{"title":"定期定额投资股市每个月300, 10年.","text":"来一个系统性的分析定期定额投资法的可行性 什么是定期定额投资法?定期定额投资法是一个系统性的投资方法。他让你在低价时买得更多，高价时买得较少，长期来看你的平均价会比较好。 无论是股市还是基金都很多人都推崇这种投资法。 模拟方法小编先聚集的10年的股市数据，分别是美国标普500指数 (SP500), 新加坡股市 (SGX), 上证指数 and 大马综合指数 (KLSE)。 也用了EXCEL来模拟，每个月定定用RM300买入指数。 Results成绩出来是好坏都有。如果你买的是SP500指数，那么恭喜你，你的回酬会是70%。如果你买的是SGX或者KLSE，就会输掉20%。 小编又找数据又模拟，所以到底定期定额投资法管不管用呢? 结论 这里表明的是, RISK/REWARD还是值得，你用-20%的风险去换来70%的回酬。 分散投资对大众来说还是可行的。如果我们没有分析股市的能力（很多人都以为自己有的能力），那么分散投资还是一个可取的方案。 投资股市长期来说是很不错的，上面的模拟并没有考虑到你在大跌的时候加码买，如果大跌时再加码（前提是要该市场长期看好），那么等股市重新回到上升周期时，赚幅会更大 说了这么多，到底要怎样买指数？买完KLSE 30只股票吗？ 我们有2种选择，第一种是ETF。ETF会长期跟踪指数，所以他的表现基本上就是跟指数一样。 而且因为不用选股，手续费会比较低。 可是，在马来西亚，ETF的选择还是比较少，而且面对着交易量低，买/卖价太大（SPREADS)的问题。 另一个选项就是基金。 基金的话就没有ETF的问题，因为你想要卖的话，基金公司是必须跟你买回的，所以只是跟着NAV交易。 如果是ETF的话，你还要担心没有买盘，而且买盘低的话还可能卖不到好价钱。 在马来西亚，基金还是一个分散投资的一个好选项。 想要了解更多的话可以电邮至klsequant@gmail.com哦","link":"/zh-cn/RM300-a-year-for-10-years/"}],"tags":[{"name":"Backtesting","slug":"Backtesting","link":"/zh-cn/tags/Backtesting/"},{"name":"Stock Picking","slug":"Stock-Picking","link":"/zh-cn/tags/Stock-Picking/"},{"name":"Python","slug":"Python","link":"/zh-cn/tags/Python/"},{"name":"蜡烛图","slug":"蜡烛图","link":"/zh-cn/tags/%E8%9C%A1%E7%83%9B%E5%9B%BE/"},{"name":"Maths","slug":"Maths","link":"/zh-cn/tags/Maths/"},{"name":"Strategy","slug":"Strategy","link":"/zh-cn/tags/Strategy/"}],"categories":[]}