{"pages":[],"posts":[{"title":"Is candlestick pattern effective in Bursa Malaysia?","text":"If you have been investing or trading stocks you must have come across about Japanese Candlestick Pattern.How effective are them? Can we use them reliably in investing or trading? Let’s find out. IntroI assume that you already knew the anatomy of a candlestick so I will skip the explanation part. There are dozens of candlestick pattern out there, be it bullish or bearish ones, what we wanted to know is that can we used them reliably in our investing and trading activities. Methodology - Skip this part if you’re not into techIt is possible to handcode a program to identify every pattern but that will be a lot of workload. Fortunately, there is a python library called TA-Lib, which included the identification of candlestick pattern given price data. In this study, 10 years worth of daily price data (Open, Low, High, Close) was scraped online and saved into a .csv file. I have written a piece of code that will iterate over the price data to find candlestick pattern. Comment below if you wanted a copy of the code and data. ResultsThe performance of each candlestick is measured by how likely it will go up in (1,5,10,30) days. A win rate of 0.7 means that in 7 out of 10 times the price will go up after the pattern appeared. Here is the best and worst 5 candlestick patterns. Wanted more? Here’s the entire backtesting results! Very surprisingly some bullish pattern has very low win rate, my thinking is that when a pattern is too widely known and used, the edge of the pattern diminishes as everyone knows the information making it useless. Besides, the findings also showed very little pattern with winrate more than 50% (I thought I will found my golden formula here :disappointed: ). However there is some relatively high winrate patterns with winrate over 0.45. Perhaps with enough risk management techniques you might be able to construct a consistently profitable strategy. Some AfterthoughtsOf course there are something this study misses, for example, some candlestick pattern are only effective while they are on top of the trend etc. Nevertheless this brings me a general view of the effectiveness of candlestick pattern. I am wondering combined with other technical indicators will the winrate be higher? Also, the low winrate doesn’t mean that it is worthless. A 20% winrate indicats there it is 80% likely that the price will drop tomorrow. How about using this as a indicator for shorting of stocks? Well, I leave this to you guys to figure out. Let me know what you think in the comments. This study is purely for discovery and fun. Please be responsible of your own money and trade at your own risk.","link":"/first-md/"},{"title":"Is stock picking based on PE useful?","text":"Whether it’s PE, ROE, DY there are tons of financial jargons and financial ratios out there. The value investors emphasize on buying cheap (low PE, PB), while growth investors focus on buying stocks with high growth (high ROE etc). How do we know which ratio is the most useful to find out potentially profitable stocks? Let’s find out. IntroductionFor today’s topic, I am going to introduce a backtesting tool that I have developed myself during free time. https://www.klsequant.com So what’s the main goal/function of this web app? Say that you have a stock picking strategy that you wanted to test out. For example, buy a stock when PE is below 10 while ROE is above 20. Then you can backtest your strategy, to see how well your stock picking strategy has performed over the last 10 years (The dataset is from 2010 to 2019). This is a web app based on Python Flask framework and this is a new challenge for me because I have only coded in Python but never in web environment. I coded the app and hosted in on pythonanywhere, definitely check them out if you are a Python guy. Brief explanation of the user interface Let me have a basic introduction to the user interface. There is 14 inputs for you, the maximum number of shares field however must be filled, the other fields are fill solely based on your stock pick criteria. Usage demonstrationFor demonstration purpose, the strategy I am using are buy when (Maximum number of stocks to buy is 10, PE is below 10, ROE is above 15 and DY above 3). If a stock fulfills the criteria it will get chosen to backtest the performance. I am using monthly frequency here (which mean the frequency you change your position to buy new stocks as the criteria might change over time for a stock) but there are plenty of choices for frequency for you to experiment as well. Let’s see how the performance goes. We gt a compounded annual growth rate (Cagr) of 36%. That is not bad at all! It is also shown that the strategy outperforms the KLSE index (the red line) as well. The program assumes that you start with capital of RM1,000. Here’s some explanation of the output. The green line is the capital growth of your stock picking strategy. The red line corresponds to performance of KLSE index. We take the performance of KLSE index as benchmark so we know have we got a better return than simply buying KLSE ETF and hold. The maximum return the strategy achieved is 48.3%, with worst return of -13.81%. On average, each trade generates 2.59% of return. The compounded annual growth rate of the strategy is 36%. The strategy also outperforms KLSE index greatly, with RM1,000 invested, you will get RM16,000 in return whereas KLSE only provide RM1,131 in return. This table is the stocks that fulfilled the stock picking criteria you defined. It gives you a rough idea what stocks will be picked based on your strategy. Why is there only 3 stocks bought in some months? It is because during the month no other stocks fulfill the stock picking criteria so only a little stocks are bought. (**Can you notice that this strategy captures super long bullish stock like Vitrox?) AfterthoughtsLet’s have a little experiment before we call it a day. How about high PE stocks vs low PE stocks? The criteria is as follow: Number of Stocks to buy : 10 Minimum ROE: 10Let’s see with the same ROE, how will PE change the profitability of a stock picking strategy?Here’s the result High PE strategy Low PE strategy The results are pretty clear that low PE DO outperform high PE stocks over time. But this is a very generalized idea, as we can see that overpriced stocks CAN get more expensive also (Like how glove counters’ PE went from 60 to 100). Howard Marks has a saying “An overpriced stock doesn’t mean that it will drop tomorrow”. But generally speaking, low PE stock does offer a better return. LimitationsThere are limitations to this web app as well. I’ll list several of them. First, there is no technical analysis picking criteria (maybe in future? If you guys loved it I will develop this feature) Second, there is no transaction fees calculated (which might eat away a huge chunk of your profit if your capital is small) Well this marks the end of this post. Do let me know if you have any feedback whether it’s good or bad. Comment below so I know what you think (I do read the comments).","link":"/Introduction-to-klsequant/"},{"title":"Magic formula of rule of 72. Why is it 72?","text":"How did mathematicians come up with the Rule of 72?? Why not 71 or 73? Rule of 72The rule of 72 is a simple formula to estimate the time that you need to double your investment based on your return. For example, how long you need to double your investment given 20% return? time = 72/x time = 72/20 time = 3.6 yearsHow to proof? 1 x 1.2 x 1.2 x 1.2 x 1.2 = 2.07Close enough right? Ever wondered where did the 72 come from? Here’s the proof.Given the formula for future value is FV = PV x (1+x)^t FV = Future Value PV = Present Value r = return t = timeIf we want to double our investment, our PV must be multiplied by 2, we end up with 2PV = PV (1+r)^t 2 = (1+r)^tLet’s add natural logarithm to both sides ln(2) = t ln(1+r) t = ln(2) / ln(1+r)According to taylor series expansion, $ln(1+r) = x - \\frac{x^2}{2} + \\frac{x^3}{3} - \\frac{x^4}{4} …..$ However, if r is very small, we can safely assume that $\\ ln(1+r) \\approx r$Thus making t = ln(2)/r t = 0.693/rMake it easier, we make it $\\times100$ t = 69.3/rBut hey! It is not 72 right?! Yeah, yeah, let me explain. 69 is only easily divisible by 1,3,23,69.To make this formula more convenient people decide to use 72 instead. Note that 72 is divisible by 1,2,3,4,6,8,12,18,24,36,72. To conclude, the rule of 72 is very good to estimate how long your investment can double. You might wonder, how far off is the value of using this formula? Well, I have made a graph below, the higher the return is, the bigger the error But this just serves as an estimation so it is good enough for most scenario. Good enough right? You tell me","link":"/Rule-of-72/"}],"tags":[{"name":"Backtesting","slug":"Backtesting","link":"/tags/Backtesting/"},{"name":"Stock Picking","slug":"Stock-Picking","link":"/tags/Stock-Picking/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"Candlestick","slug":"Candlestick","link":"/tags/Candlestick/"},{"name":"Maths","slug":"Maths","link":"/tags/Maths/"}],"categories":[]}